Enums/ВариантыУчетаСтоимостиВыпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыУчетаСтоимостиВыпуска</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтклоненияСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическаяСтоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановаяСтоимость</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиТоваровВРознице</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценкиТоваровВРознице</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойСчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОказаниеУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиректКостинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокСписанияРасходовНаСебестоимостьУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокСписанияРасходовНаСебестоимостьУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьСебестоимостьПолуфабрикатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСебестоимостиПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСебестоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьСебестоимостьУслугСобственнымПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособУчетаВыпускаГотовойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаСтоимостиВыпуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьРасходыПоЭлементамЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьРасходыПоСтатьямЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьРезервыПоСомнительнымДолгам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантБухгалтерскойОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыБухгалтерскойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддержкаПБУ18</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПлановуюСебестоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаОтложенногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаОтложенногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыОбслуживающихПроизводствВключатьВПрочиеРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбесценениеЗапасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияАвансовВыданных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОтраженияАвансовВыданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыУчетаСтоимостиВыпуска/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет, нужен ли для указанного варианта учета счет 40 "Выпуск продукции"
//
// Параметры:
//  ВариантУчета - ПеречислениеСсылка.ВариантыУчетаСтоимостиВыпуска
// 
// Возвращаемое значение:
//  Булево
//
Функция ИспользоватьСчетВыпускПродукции(ВариантУчета) Экспорт
	
	Возврат ВариантУчета = ОтклоненияСтоимости Или ВариантУчета = ПлановаяСтоимость;
	
КонецФункции

// Определяет, какой алгоритм используется для учета отклонений фактической стоимости готовой продукции от плановой
// (для варианта учета по фактической стоимости с отражением отклонений от плановой на счете 40).
//
// Транзитный алгоритм - исторически более ранний.
// Он заключается в том, что весь расчет выполняется, как если бы счет 40 не использовался.
// Затем, когда все проводки сформированы, проводки вида Дт 43 Кт 20 механически делятся на две - 
// вставляется транзитный счет 40.
// В результате такого алгоритма оценка запасов будет идентичная, вне зависимости от того, применяется счет 40 или нет.
// Для применения этого алгоритма субконто Продукция на счете 40 не требуется (алгоритмом субконто не используется).
//
// В соответствии с ФСБУ 5 допускается учет продукции по плановой стоимости.
// Как следствие, в этом случае такой алгоритм не применим.
// Для учета по плановой стоимости счет 40 является полноценным центром затрат,
// на котором стоимость выпускаемой продукции учитывается с аналитикой, заданной на этом счете.
// Для применения этого алгоритма на счет 40 добавляется субконто Продукция
//
// На базе этого же алгоритма можно реализовать и учет готовой продукции по фактической стоимости.
// Это позволяет унифицировать алгоритм.
// Однако, это требует заполнения субконто Продукция первичными документами.
// Кроме того, результат применения алгоритма может отличаться от транзитного -
// в тех случаях, когда аналитика на счете 40 обеспечивает меньшую детализацию, чем на счетах прямых расходов.
// Пример таких отличий: выполняются две работы, с одинаковым наименованием, в одном и том же подразделении,
// по одной и той же номенклатурной группе.Однако по одной работе затраты отражены на счете 20, по другой - на счете 23.
// Для транзитного алгоритма стоимость услуг формируется независимо (потому что счет разный),
// а при использовании аналитики на счете 40 стоимость таких услуг будет усреднена.
// Также в частном случае это может привести к диагностике встречного выпуска.
//
// Поэтому в конфигурации транзитный алгоритм применяется, когда нужно сохранить поведение: т.е. для пользователей,
// которые ранее его фактически использовали.
// Для пользователей, которые в новой базе включают применение счета 40, транзитный алгоритм не используется.
// См. также УстановитьТранзитныйАлгоритмУчетаОтклоненийОтПлановойСебестоимости и ИспользоватьСубконтоПродукция
//
// Параметры:
//  ВариантУчета - ПеречислениеСсылка.ВариантыУчетаСтоимостиВыпуска
// 
// Возвращаемое значение:
//  Булево - Истина, если в информационной базе может использоваться транзитный алгоритм.
//
Функция ТранзитныйАлгоритмУчетаОтклоненийОтПлановойСебестоимости(ВариантУчета) Экспорт
	
	Если ВариантУчета <> ОтклоненияСтоимости Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидСубконто
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции)
	|	И ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Продукция)
	|	И ХозрасчетныйВидыСубконто.Суммовой";
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

#Область СубконтоПродукция

// Определяет необходимость использования субконто Продукция на счете 40 Выпуск продукции.
//
// Параметры:
//  ВариантУчета - ПеречислениеСсылка.ВариантыУчетаСтоимостиВыпуска
// 
// Возвращаемое значение:
//  Булево - Истина, если субконто следует использовать
//
Функция ИспользоватьСубконтоПродукция(ВариантУчета) Экспорт
	
	Если ВариантУчета = ПлановаяСтоимость Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ВариантУчета <> ОтклоненияСтоимости Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТранзитныйАлгоритмУчетаОтклоненийОтПлановойСебестоимости(ВариантУчета) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Не Константы.ТранзитныйАлгоритмУчетаОтклоненийОтПлановойСебестоимости.Получить();
	// Субконто может не добавляться для совместимости.
	// Константа обозначает наличие режима совместимости.
	// См. ТранзитныйАлгоритмУчетаОтклоненийОтПлановойСебестоимости
	
КонецФункции

// Инициализирует коллекцию для глобального механизма настройки субконто - см. ОбщегоНазначенияБП.ПолучитьДействияИзмененияСубконто
//
// Параметры:
//  ПараметрыУчета - Структура - см. ОбщегоНазначенияБП.ОпределитьПараметрыУчета
//
Процедура УстановитьПараметрУчетаПродукция(ПараметрыУчета) Экспорт
	
	ОписаниеСубконтоНаСчете = ПланыСчетов.Хозрасчетный.ВыпускПродукции.ВидыСубконто.Найти(
		ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Продукция);
	Значение = (ОписаниеСубконтоНаСчете <> Неопределено);
	
	ПараметрыУчета.Вставить(ГлобальноеИмяРазрезаАналитикиПродукция(), Значение);
	
КонецПроцедуры

// Устанавливает необходимость использования субконто для глобального механизма настройки субконто -
// см. НастройкиУчета.ВключитьРасширеннуюАналитику
//
// Параметры:
//  РазрезыАналитики - Массив - имена потребных разрезов аналитики, как указано в УстановитьПараметрУчетаПродукция
//  ВариантУчета - ПеречислениеСсылка.ВариантыУчетаСтоимостиВыпуска - применяемый вариант учета
//
Процедура УстановитьРазрезАналитикиПродукция(РазрезыАналитики, ВариантУчета) Экспорт
	
	Если Не ИспользоватьСубконтоПродукция(ВариантУчета) Тогда
		Возврат;
	КонецЕсли;
	
	РазрезыАналитики.Добавить(ГлобальноеИмяРазрезаАналитикиПродукция());
	
КонецПроцедуры

// Содержит описание разрезов учета для глобального механизма настройки субконто.
//
// Параметры - см. ОбщегоНазначенияБП.ПолучитьСоответствиеСубконтоПараметрамУчета
//
Процедура ДобавитьОписаниеРазрезовУчета(ОписаниеРазрезовУчета, ШаблонОписанияСчетов, ШаблонОписанияВидовСубконто, ШаблонОписанияПараметров, ШаблонОписанияИсключений) Экспорт
	
	ОписаниеРазрезаУчета = ОписаниеРазрезовУчета.Добавить();
	ОписаниеРазрезаУчета.Счета = ШаблонОписанияСчетов.СкопироватьКолонки();
	ОписаниеРазрезаУчета.Субконто  = ШаблонОписанияВидовСубконто.СкопироватьКолонки();
	ОписаниеРазрезаУчета.Параметры = ШаблонОписанияПараметров.СкопироватьКолонки();
	
	ОписаниеСчета = ОписаниеРазрезаУчета.Счета.Добавить();
	ОписаниеСчета.Счет = ПланыСчетов.Хозрасчетный.ВыпускПродукции;
	
	ОписаниеСубконто = ОписаниеРазрезаУчета.Субконто.Добавить();
	ОписаниеСубконто.Вид            = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Продукция;
	ОписаниеСубконто.Суммовой       = Истина;
	ОписаниеСубконто.ТолькоОбороты  = Истина;
	ОписаниеСубконто.Параметр       = ГлобальноеИмяРазрезаАналитикиПродукция();
	
	ОписаниеПараметра = ОписаниеРазрезаУчета.Параметры.Добавить();
	ОписаниеПараметра.Имя        = ГлобальноеИмяРазрезаАналитикиПродукция();
	ОписаниеПараметра.Исключения = ШаблонОписанияИсключений.Скопировать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиОбновления

// См. ТранзитныйАлгоритмУчетаОтклоненийОтПлановойСебестоимости
//
Процедура УстановитьТранзитныйАлгоритмУчетаОтклоненийОтПлановойСебестоимости() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК РежимСовместимости
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитика
	|ГДЕ
	|	УчетнаяПолитика.СпособУчетаВыпускаГотовойПродукции = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаСтоимостиВыпуска.ОтклоненияСтоимости)";
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запись = Константы.ТранзитныйАлгоритмУчетаОтклоненийОтПлановойСебестоимости.СоздатьМенеджерЗначения();
	Запись.Прочитать();
	Если Запись.Значение = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Значение = Истина;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Запись);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ГлобальноеИмяРазрезаАналитикиПродукция()
	Возврат "УчитыватьВыпускПродукцииПоПродукции";
КонецФункции

#КонецОбласти

#КонецЕсли
